<script setup></script>

<template>
  <div id="about-us">
    <div id="greeting">
      <h3 class="size-18">О нас</h3>
      <p>
        Добро пожаловать в наше уютное место, где мы создаем и доставляем вам самые свежие и вкусные
        роллы, суши и вок. Мы являемся вашим надежным партнером в мире японской кухни на вынос и с
        доставкой.
      </p>
    </div>
    <div id="misson">
      <h3 class="size-18">Наша миссия</h3>
      <p>
        Наша главная цель - радовать вас неповторимыми блюдами и превосходным обслуживанием. Мы
        стремимся предоставить нашим клиентам лучший опыт заказа и доставки блюд японской кухни,
        предлагая разнообразие качественных и свежих ингредиентов.
      </p>
    </div>
    <div id="menu">
      <h3 class="size-18">Наше меню</h3>
      <p>
        В нашем меню вы найдете широкий выбор роллов, суши и воков, приготовленных на заказ с
        использованием только лучших ингредиентов. Мы гордимся своими традиционными и современными
        рецептами, которые придутся по вкусу каждому ценителю японской кухни.
      </p>
    </div>
    <div>
      <h3 id="delivery" class="size-18">Доставка</h3>
      <p>
        Мы предлагаем удобный сервис доставки, чтобы вы могли насладиться нашими блюдами прямо у
        себя дома или в офисе. Наша команда стремится обеспечить быструю и безопасную доставку,
        чтобы ваш заказ всегда был свежим и вовремя.
      </p>
    </div>
    <p id="end">Мы рады, что вы выбрали нас, и надеемся увидеть вас снова!</p>
  </div>
</template>

<style lang="scss" scoped>
@import '@/assets/mixin.scss';

#about-us {
  @include flexColumn();
}
h3 {
  @include header(18px);
}
p {
  @include paragraph();
  padding-top: 10px;
}
#end {
  margin: auto;
}
</style>
