<script setup></script>

<template>
  <div id="privacy-policy">
    <h2 class="size-20">Политика конфиденциальности</h2>
    <p>
      Добро пожаловать на страницу политики конфиденциальности нашего сайта по доставке роллов. Мы
      ценим ваше доверие и обязуемся защищать вашу личную информацию.
    </p>
    <div>
      <h3 class="size-18">Сбор информации</h3>
      <p>При использовании нашего сайта и услуг мы можем собирать следующие виды информации:</p>
      <ul>
        <li>
          <strong>Личные данные: </strong>мы можем собирать ваше имя, номер телефона и адрес
          доставки для обеспечения выполнения заказов.
        </li>
        <li>
          <strong>Информация о заказах: </strong>мы сохраняем информацию о ваших заказах, включая
          выбранные блюда, специальные предпочтения и иные детали, необходимые для доставки.
        </li>
      </ul>
    </div>
    <div>
      <h3 class="size-18">Использование информации</h3>
      <p>Мы используем собранную информацию для следующих целей:</p>
      <ul>
        <li>
          <strong>Обработка заказов: </strong>ваша личная информация используется для обработки
          заказов и организации доставки выбранных блюд.
        </li>
        <li>
          <strong>Улучшение сервиса: </strong>мы анализируем данные, чтобы улучшить качество нашего
          сервиса и предлагаемых блюд.
        </li>
        <li>
          <strong>Контакт с вами: </strong>мы можем использовать вашу контактную информацию для
          уведомлений о заказах, акциях и специальных предложениях.
        </li>
      </ul>
    </div>
    <div>
      <h3 class="size-18">Защита данных</h3>
      <p>
        Мы прилагаем все возможные меры безопасности для защиты вашей личной информации от
        несанкционированного доступа, использования или раскрытия.
      </p>
    </div>
    <div>
      <h3 class="size-18">Передача информации третьим лицам</h3>
      <p>
        Мы не передаем вашу личную информацию третьим лицам без вашего согласия, за исключением
        случаев, предусмотренных законом.
      </p>
    </div>
    <div>
      <h3 class="size-18">Согласие с политикой конфиденциальности</h3>
      <p>
        Используя наш веб-сайт и услуги, вы выражаете свое согласие с нашей политикой
        конфиденциальности.
      </p>
    </div>
    <p>
      Пожалуйста, свяжитесь с нами по адресу
      <a href="mailto:info@deliveryrolls.ru">info@deliveryrolls.ru</a>, если у вас возникли вопросы
      или требуется дополнительная информация о нашей политике конфиденциальности.
    </p>
    <strong>Дата вступления в силу: [дата]</strong>
    <strong>Последнее обновление: [дата]</strong>
  </div>
</template>

<style lang="scss" scoped>
@import '@/assets/mixin.scss';

#privacy-policy {
  @include flexColumn();
}
h2 {
  @include header(20px);
}
p {
  @include paragraph();
  padding-top: 10px;
}
h3 {
  @include header(18px);
}
ul {
  @include ulChanged();
}
</style>
