<script setup></script>

<template>
  <div id="user-agreement">
    <h2 class="size-20">Пользовательское соглашение</h2>
    <p>
      Добро пожаловать на страницу пользовательского соглашения нашего сайта по доставке роллов. Мы
      уважаем вашу конфиденциальность и обеспечиваем защиту ваших данных.
    </p>
    <h3 class="size-18">Сбор информации</h3>
    <p>При использовании нашего сайта и услуг мы можем собирать следующую информацию:</p>
    <ul>
      <li>
        Личные данные: мы собираем ваше имя, адрес электронной почты, номер телефона и адрес
        доставки для обработки заказов и организации доставки.
      </li>
      <li>
        Информация о заказах: мы сохраняем информацию о ваших заказах, включая выбранные блюда,
        специальные предпочтения и другие детали, необходимые для выполнения заказов.
      </li>
    </ul>
    <h3 class="size-18">Использование информации</h3>
    <p>Мы используем собранную информацию для следующих целей:</p>
    <ul>
      <li>
        Обработка заказов: ваша личная информация используется для организации доставки выбранных
        блюд.
      </li>
      <li>
        Улучшение сервиса: мы анализируем данные, чтобы улучшить качество нашего сервиса и
        предлагаемых блюд.
      </li>
      <li>
        Связь с вами: мы можем использовать вашу контактную информацию для уведомлений о заказах,
        акциях и специальных предложениях.
      </li>
    </ul>
    <h3 class="size-18">Защита данных</h3>
    <p>
      Мы применяем меры безопасности для защиты вашей личной информации от несанкционированного
      доступа, использования или раскрытия.
    </p>
    <h3>Передача информации третьим лицам</h3>
    <p>
      Мы не передаем вашу личную информацию третьим лицам без вашего согласия, за исключением
      случаев, предусмотренных законом.
    </p>
    <h3 class="size-18">Согласие с пользовательским соглашением</h3>
    <p>
      Используя наш веб-сайт и услуги, вы подтверждаете свое согласие с нашим пользовательским
      соглашением.
    </p>
    <p>
      Пожалуйста, свяжитесь с нами по адресу info@deliveryrolls.ru, если у вас возникли вопросы или
      требуется дополнительная информация о нашем пользовательском соглашении.
    </p>
    <strong>Дата вступления в силу: [указать дату]</strong>
    <strong>Последнее обновление: [указать дату]</strong>
  </div>
</template>

<style lang="scss" scoped>
@import '@/assets/mixin.scss';

#user-agreement {
  @include flexColumn();
}
h2 {
  @include header(20px);
}
p {
  @include paragraph();
}
h3 {
  @include header(18px);
}
ul {
  @include ulChanged();
}
</style>
